config/emacs/emacs.org
#+TITLE: Emacs config
#+DESCRIPTION: A literate Emacs config written in Org
#+AUTHOR: Matei Cotocel
#+PROPERTY: header-args :tangle yes

* Intro

Emacs is not just a mere text editor. It's a Lisp machine with text editing capabilities. This means anything you can think of, Emacs can do it. Of course, you have text editing capabilities. But you can also use it as a Git frontend. as an IRC client, an RSS reader. Such is the extensible of Emacs.

In this Org document, you'll find my literate Emacs configuration. I wouldn't advise you to use this as your config. Instead, you should add snippets of this document to your configuration.
  
* General settings
  
** Small changes

We add the load path for pieces of lisp code, and change the warning level to emergency so we don't get distracted. We also load a =private.el= file, where I store passwords.
  
#+BEGIN_SRC emacs-lisp
  (load-file "~/.config/emacs/etc/private.el")
  (add-to-list 'load-path "~/.config/emacs/lisp/")
  (setq warning-minimum-level :emergency)
  (setq auto-window-vscroll nil)
  (setq frame-resize-pixelwise t)
#+END_SRC

** Package config

We setup melpa, use-package, and straight.el for installing package later on. Melpa is better than elpa since it has a lot more packages than elpa. Use-package is pretty useful since packages can be automatically installed and lazy-loaded. Straight.el is for downloading packages from git. We also install a package to update installed packages

#+BEGIN_SRC emacs-lisp
  (require 'package)

  (setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                           ("melpa" . "http://melpa.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package)

  (setq use-package-always-ensure t)
  (setq straight-use-package-by-default t)

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  (setq package-enable-at-startup nil)

  (use-package auto-package-update
     :ensure t
     :config
     (setq auto-package-update-delete-old-versions t
           auto-package-update-interval 4)
     (auto-package-update-maybe))
#+END_SRC

** Git info

We set up our username and email for git.
  
#+BEGIN_SRC emacs-lisp
  (when (equal ""
               (shell-command-to-string "git config user.name"))
    (shell-command "git config --global user.name \"Matei Cotocel\"")
    (shell-command "git config --global user.email \"mcotocel@outlook.com\""))
#+END_SRC

** UI elements

We remove unnecessary UI elements, like the menu bar, scroll bar, and tool bar. These are useless, I don't like them, I don't want them. We also add padding.

#+BEGIN_SRC emacs-lisp
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (setq inhibit-splash-screen t
        inhibit-startup-echo-area-message t
        inhibit-startup-message t)
  (setq ring-bell-function 'ignore)
  (set-frame-parameter nil 'internal-border-width 10)
#+END_SRC

#+RESULTS:

** Font

*** Normal font

Here we set a nice font, because if I'm going to be staring at code for hours, I want it to look good. Change the font size to whatever you want.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(font . "Iosevka Nerd Font"))
#+END_SRC

*** Symbol font

We also need to set a symbol font. Here I use Twemoji, since it looks pretty good.

#+BEGIN_SRC emacs-lisp
  (set-fontset-font t 'symbol (font-spec :family "Twemoji") nil 'prepend)
#+END_SRC

** Prettify symbols

This replaces some text with icons.

#+begin_src emacs-lisp
    (defun org/prettify-set ()
      (interactive)
      (setq prettify-symbols-alist
          '(("#+begin_src" . "")
            ("#+BEGIN_SRC" . "")
            ("#+end_src" . "")
            ("#+END_SRC" . "")
            ("#+begin_example" . "")
            ("#+BEGIN_EXAMPLE" . "")
            ("#+end_example" . "")
            ("#+END_EXAMPLE" . "")
            ("#+results:" . "")
            ("#+RESULTS:" . "")
            ("#+begin_quote" . "❝")
            ("#+BEGIN_QUOTE" . "❝")
            ("#+end_quote" . "❞")
            ("#+END_QUOTE" . "❞")
            ("[ ]" . "☐")
            ("[-]" . "◯")
            ("[X]" . "☑"))))
    (add-hook 'org-mode-hook 'org/prettify-set)

    (defun prog/prettify-set ()
      (interactive)
      (setq prettify-symbols-alist
          '(("lambda" . "λ")
            ("->" . "→")
            ("<-" . "←")
            ("<=" . "≤")
            (">=" . "≥")
            ("!=" . "≠")
            ("~=" . "≃")
            ("=~" . "≃"))))
    (add-hook 'prog-mode-hook 'prog/prettify-set)

  (global-prettify-symbols-mode)

#+end_src

** Line numbers

 Line numbers are very useful. Relative line numbers are even more so, since you don't do much maths with them.

 #+begin_src emacs-lisp
   (global-display-line-numbers-mode)
   (setq display-line-numbers-type 'relative)
 #+end_src

 Sometimes line numbers can be distracting, so we disable them for certain modes

 #+BEGIN_SRC emacs-lisp
   (dolist (mode '(org-mode-hook
                   term-mode-hook
                   eshell-mode-hook
                   neotree-mode-hook
                   elfeed-show-mode
                   circe-channel-mode
                   circe-chat-mode
                   woman-mode-hook))
   (add-hook mode (lambda () (display-line-numbers-mode 0))))
 #+END_SRC

