config/emacs/emacs.tex
% Created 2021-08-25 Wed 16:08
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Matei Cotocel}
\date{\today}
\title{Emacs config}
\hypersetup{
 pdfauthor={Matei Cotocel},
 pdftitle={Emacs config},
 pdfkeywords={},
 pdfsubject={A literate Emacs config written in Org},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section*{Intro}
\label{sec:org84cda55}

Emacs is not just a mere text editor. It's a Lisp machine with text editing capabilities. This means anything you can think of, Emacs can do it. Of course, you have text editing capabilities. But you can also use it as a Git frontend. as an IRC client, an RSS reader. Such is the extensible of Emacs.

In this Org document, you'll find my literate Emacs configuration. I wouldn't advise you to use this as your config. Instead, you should add snippets of this document to your configuration.

\section*{General settings}
\label{sec:org592848c}

\subsection*{Small changes}
\label{sec:orgf643ef9}

We add the load path for pieces of lisp code, and change the warning level to emergency so we don't get distracted. We also load a \texttt{private.el} file, where I store passwords.

\begin{minted}[]{common-lisp}
(load-file "~/.config/emacs/etc/private.el")
(add-to-list 'load-path "~/.config/emacs/lisp/")
(setq warning-minimum-level :emergency)
(setq auto-window-vscroll nil)
(setq frame-resize-pixelwise t)
\end{minted}

\subsection*{Package config}
\label{sec:orge8119ae}

We setup melpa, use-package, and straight.el for installing package later on. Melpa is better than elpa since it has a lot more packages than elpa. Use-package is pretty useful since packages can be automatically installed and lazy-loaded. Straight.el is for downloading packages from git. We also install a package to update installed packages

\begin{minted}[]{common-lisp}
(require 'package)

(setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                         ("melpa" . "http://melpa.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(require 'use-package)

(setq use-package-always-ensure t)
(setq straight-use-package-by-default t)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
(setq package-enable-at-startup nil)

(use-package auto-package-update
   :ensure t
   :config
   (setq auto-package-update-delete-old-versions t
         auto-package-update-interval 4)
   (auto-package-update-maybe))
\end{minted}

\subsection*{Git info}
\label{sec:orgfd18f1e}

We set up our username and email for git.

\begin{minted}[]{common-lisp}
(when (equal ""
             (shell-command-to-string "git config user.name"))
  (shell-command "git config --global user.name \"Matei Cotocel\"")
  (shell-command "git config --global user.email \"mcotocel@outlook.com\""))
\end{minted}

\subsection*{UI elements}
\label{sec:orgee60115}

We remove unnecessary UI elements, like the menu bar, scroll bar, and tool bar. These are useless, I don't like them, I don't want them. We also add padding.

\begin{minted}[]{common-lisp}
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(setq inhibit-splash-screen t
      inhibit-startup-echo-area-message t
      inhibit-startup-message t)
(setq ring-bell-function 'ignore)
(set-frame-parameter (selected-frame) 'internal-border-width 15)
\end{minted}

\subsection*{Font}
\label{sec:orga3fedee}

\subsubsection*{Normal font}
\label{sec:orgded0a6c}

Here we set a nice font, because if I'm going to be staring at code for hours, I want it to look good. Change the font size to whatever you want.

\begin{minted}[]{common-lisp}
(add-to-list 'default-frame-alist '(font . "Iosevka Nerd Font-12"))
\end{minted}

\subsubsection*{Symbol font}
\label{sec:org37c03b4}

We also need to set a symbol font. Here I use Twemoji, since it looks pretty good.

\begin{minted}[]{common-lisp}
(set-fontset-font t 'symbol (font-spec :family "Twemoji") nil 'prepend)
\end{minted}

\subsection*{Prettify symbols}
\label{sec:orgc65e209}

This replaces some text with icons.

\begin{minted}[]{common-lisp}
  (defun org/prettify-set ()
    (interactive)
    (setq prettify-symbols-alist
        '(("#+begin_src" . "")
          ("#+BEGIN_SRC" . "")
          ("#+end_src" . "")
          ("#+END_SRC" . "")
          ("#+begin_example" . "")
          ("#+BEGIN_EXAMPLE" . "")
          ("#+end_example" . "")
          ("#+END_EXAMPLE" . "")
          ("#+results:" . "")
          ("#+RESULTS:" . "")
          ("#+begin_quote" . "❝")
          ("#+BEGIN_QUOTE" . "❝")
          ("#+end_quote" . "❞")
          ("#+END_QUOTE" . "❞")
          ("[ ]" . "☐")
          ("[-]" . "◯")
          ("[X]" . "☑"))))
  (add-hook 'org-mode-hook 'org/prettify-set)

  (defun prog/prettify-set ()
    (interactive)
    (setq prettify-symbols-alist
        '(("lambda" . "λ")
          ("->" . "→")
          ("<-" . "←")
          ("<=" . "≤")
          (">=" . "≥")
          ("!=" . "≠")
          ("~=" . "≃")
          ("=~" . "≃"))))
  (add-hook 'prog-mode-hook 'prog/prettify-set)

(global-prettify-symbols-mode)

\end{minted}

\subsection*{Line numbers}
\label{sec:orgc486b6f}

Line numbers are very useful. Relative line numbers are even more so, since you don't do much maths with them.

\begin{minted}[]{common-lisp}
(global-display-line-numbers-mode)
(setq display-line-numbers-type 'relative)
\end{minted}

Sometimes line numbers can be distracting, so we disable them for certain modes

\begin{minted}[]{common-lisp}
(dolist (mode '(org-mode-hook
  term-mode-hook
  eshell-mode-hook
  neotree-mode-hook
  elfeed-show-mode-hook
  circe-channel-mode-hook
  circe-chat-mode-hook
  doc-view-mode-hook
  woman-mode-hook))
(add-hook mode (lambda () (display-line-numbers-mode 0))))
\end{minted}
