config/emacs/emacs.tex

\subsection*{File locations}
\label{sec:org48ad93a}

To keep thing organized, we set the locations of different files here.

\begin{minted}[]{common-lisp}
(setq recentf-save-file "~/.config/emacs/etc/recentf" ;; File for recentf
      recentf-max-saved-items 50)
(setq savehist-file "~/.config/emacs/etc/savehist" ;; File for save history
      history-length 150)
(setq save-place-file "~/.config/emacs/etc/saveplace") ;; File for save place
(setq bookmark-default-file "~/.config/emacs/etc/bookmarks") ;; File for bookmarks
(setq backup-directory-alist '(("." . "~/.config/emacs/backups")) ;; Directory for backups
      delete-old-versions t
      kept-old-versions 20
      vc-make-backup-files t
      version-control t)
(setq custom-file "~/.config/emacs/etc/custom.el") ;; For saved customizations
(setq create-lockfiles nil) ;; Disable lockfiles
\end{minted}

\subsection*{Miscellaneous minor modes}
\label{sec:orgf19a807}

These are some useful minor modes that I tend to use.

\begin{minted}[]{common-lisp}
(save-place-mode) ;; Save location
(global-visual-line-mode) ;; Wrap lines
(add-hook 'org-mode-hook 'flyspell-mode) ;; Spell checker
\end{minted}

\subsection*{New line}
\label{sec:orga634346}

Style guides usually say there should be an empty line at the end of a file, so we enable this here.

\begin{minted}[]{common-lisp}
(setq require-final-newline t)
\end{minted}

\subsection*{Y/N}
\label{sec:org6fcb166}

When Emacs prompts us, you need to fully type \emph{yes} or \emph{no}. This replaces it with \emph{y} or \emph{n.}

\begin{minted}[]{common-lisp}
(defalias 'yes-or-no-p 'y-or-n-p)
\end{minted}

\subsection*{Scroll}
\label{sec:orgf320b59}

Better and smoother scroll that \emph{doesn't} make your eyes hurt.

\begin{minted}[]{common-lisp}
(setq redisplay-dont-pause t
  scroll-margin 1
  scroll-step 1
  scroll-conservatively 10000
  scroll-preserve-screen-position 1
  scroll-up-aggressively 0.01
  scroll-down-aggressively 0.01)
\end{minted}

\subsection*{Indentation}
\label{sec:org3f3383b}

Here we configure indentation. I prefer using tabs, but I convert them to spaces.

\begin{minted}[]{common-lisp}
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
(setq indent-line-function 'insert-tab)
\end{minted}

\subsection*{Disabled commands}
\label{sec:orgfe49287}

Yes Emacs, I'm \emph{sure} I want to use the command. Or even better, why don't we enable them all?

\begin{minted}[]{common-lisp}
(setq disabled-command-function nil)
\end{minted}

\subsection*{Shell script mode}
\label{sec:orgc4950f2}

I edit PKGBUILD files (for pacman) quite a lot, and they're basically shell scripts.

\begin{minted}[]{common-lisp}
(add-to-list 'auto-mode-alist '("PKGBUILD\\'" . shell-script-mode))
\end{minted}

\section*{Package settings}
\label{sec:org2673298}

\subsection*{Path}
\label{sec:org0ae0fbf}

First we install a package to set the path for macOS, since for some reason it doesn't work out of the box.

\begin{minted}[]{common-lisp}
(use-package exec-path-from-shell
   :config
   (exec-path-from-shell-initialize))
\end{minted}

\subsection*{Evil keybindings}
\label{sec:orgb5321d5}

Here we install and configure evil, since I \emph{cannot} use the default Emacs keys. Evil is the only way I've managed to move to Emacs. The Vim key bindings are a \emph{lot} better than the Emacs keybindings. evil-collection is for miscellaneous minor modes, evil-org for org mode, and evil leader adds a leader key.

\subsubsection*{Base}
\label{sec:org14c8151}

This is the main evil package, that allows you to use vim keybindings.

\begin{minted}[]{common-lisp}
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  :config
  (evil-mode 1))
\end{minted}

\subsubsection*{Collection}
\label{sec:orgc8b365f}

This package adds vim keybindings for miscellaneous minor modes, such as dired and mu4e.

\begin{minted}[]{common-lisp}
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
\end{minted}

\subsubsection*{Org}
\label{sec:orgd859df0}

For some reason evil-collection doesn't include org bindings, so we install another package.

\begin{minted}[]{common-lisp}
(use-package evil-org
  :after org
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
\end{minted}
\subsubsection*{Leader}
\label{sec:org6202755}

This adds a leader key to Emacs, which is \emph{incredibly} useful.

\begin{minted}[]{common-lisp}
(use-package evil-leader
  :config
  (global-evil-leader-mode)
  (evil-leader/set-leader "<SPC>")
  (evil-leader/set-key
    ;; General
    "<SPC>" 'counsel-M-x
    ".f" 'counsel-grep-or-swiper
    ".q" 'delete-frame
    ;; Undo
    "uv" 'undo-tree-visualize
    "uu" 'undo-tree-undo
    "ur" 'undo-tree-redo
    "uc" 'counsel-yank-pop
    ;; Files
    "fr" 'counsel-recentf
    "fb" 'counsel-bookmark
    "ff" 'counsel-find-file
    "fd" 'counsel-dired
    ;; Bufffers
    "bv" 'split-window-right
    "bh" 'split-window-below
    "bd" 'kill-current-buffer
    ;; Projectile
    "pf" 'projectile-find-file
    "pp" 'projectile-switch-project
    "pg" 'projectile-grep
    "pm" 'projectile-commander
    "pc" 'projectile-compile-project
    ;; Org mode
    "oc" 'org-edit-special
    "ol" 'org-latex-previw
    "ot" 'org-ctrl-c-ctrl-c
    "oi" 'org-toggle-inline-images
    "oa" 'org-agenda
    "os" 'org-schedule
    ; Export
    "oep" 'org-latex-export-to-pdf
    "oeh" 'org-html-export-to-html
    ; Roam
    "orf" 'org-roam-node-find
    "ori" 'org-roam-node-insert
    "oru" 'org-roam-db-sync
    ; Babel
    "obs" 'org-babel-execute-src-block
    "obb" 'org-babel-execute-buffer
    "obl" 'org-babel-load-file
    ;; Workgroups
    "wa" 'ivy-push-view
    "wd" 'ivy-pop-view
    "ws" 'ivy-switch-view
    ;; Help
    "hh" 'help
    "hk" 'describe-key
    "hv" 'describe-variable
    "hf" 'describe-function
    "hs" 'describe-symbol
    "hm" 'describe-mode
    ;; Magit
    "gs" 'magit-status))
\end{minted}
