config/emacs/emacs.el

(setq recentf-save-file "~/.config/emacs/etc/recentf" ;; File for recentf
      recentf-max-saved-items 50)
(setq savehist-file "~/.config/emacs/etc/savehist" ;; File for save history
      history-length 150)
(setq save-place-file "~/.config/emacs/etc/saveplace") ;; File for save place
(setq bookmark-default-file "~/.config/emacs/etc/bookmarks") ;; File for bookmarks
(setq backup-directory-alist '(("." . "~/.config/emacs/backups")) ;; Directory for backups
      delete-old-versions t
      kept-old-versions 20
      vc-make-backup-files t
      version-control t)
(setq custom-file "~/.config/emacs/etc/custom.el") ;; For saved customizations
(setq create-lockfiles nil) ;; Disable lockfiles

(save-place-mode) ;; Save location
(global-visual-line-mode) ;; Wrap lines
(add-hook 'org-mode-hook 'flyspell-mode) ;; Spell checker

(setq require-final-newline t)

(defalias 'yes-or-no-p 'y-or-n-p)

(setq redisplay-dont-pause t
  scroll-margin 1
  scroll-step 1
  scroll-conservatively 10000
  scroll-preserve-screen-position 1
  scroll-up-aggressively 0.01
  scroll-down-aggressively 0.01)

(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
(setq indent-line-function 'insert-tab)

(setq disabled-command-function nil)

(add-to-list 'auto-mode-alist '("PKGBUILD\\'" . shell-script-mode))

(use-package exec-path-from-shell
   :config
   (exec-path-from-shell-initialize))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package evil-org
  :after org
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package evil-leader
  :config
  (global-evil-leader-mode)
  (evil-leader/set-leader "<SPC>")
  (evil-leader/set-key
    ;; General
    "<SPC>" 'counsel-M-x
    ".f" 'counsel-grep-or-swiper
    ".q" 'delete-frame
    ;; Undo
    "uv" 'undo-tree-visualize
    "uu" 'undo-tree-undo
    "ur" 'undo-tree-redo
    "uc" 'counsel-yank-pop
    ;; Files
    "fr" 'counsel-recentf
    "fb" 'counsel-bookmark
    "ff" 'counsel-find-file
    "fd" 'counsel-dired
    ;; Bufffers
    "bv" 'split-window-right
    "bh" 'split-window-below
    "bd" 'kill-current-buffer
    ;; Projectile
    "pf" 'projectile-find-file
    "pp" 'projectile-switch-project
    "pg" 'projectile-grep
    "pm" 'projectile-commander
    "pc" 'projectile-compile-project
    ;; Org mode
    "oc" 'org-edit-special
    "ol" 'org-latex-previw
    "ot" 'org-ctrl-c-ctrl-c
    "oi" 'org-toggle-inline-images
    "oa" 'org-agenda
    "os" 'org-schedule
    ; Export
    "oep" 'org-latex-export-to-pdf
    "oeh" 'org-html-export-to-html
    ; Roam
    "orf" 'org-roam-node-find
    "ori" 'org-roam-node-insert
    "oru" 'org-roam-db-sync
    ; Babel
    "obs" 'org-babel-execute-src-block
    "obb" 'org-babel-execute-buffer
    "obl" 'org-babel-load-file
    ;; Workgroups
    "wa" 'ivy-push-view
    "wd" 'ivy-pop-view
    "ws" 'ivy-switch-view
    ;; Help
    "hh" 'help
    "hk" 'describe-key
    "hv" 'describe-variable
    "hf" 'describe-function
    "hs" 'describe-symbol
    "hm" 'describe-mode
    ;; Magit
    "gs" 'magit-status))
