config/emacs/emacs.org
*** Additional keybindings

Here I bind some extra keybindings for evil mode.
    
#+BEGIN_SRC emacs-lisp

  (define-key evil-normal-state-map (kbd "M-s") 'save-buffer)
  (define-key evil-normal-state-map (kbd "M-q") 'delete-window)
  (define-key evil-normal-state-map (kbd "M-w") 'kill-current-buffer)

  (define-key evil-normal-state-map (kbd "M-x") 'counsel-M-x)
  (define-key evil-normal-state-map (kbd "<C-tab>") 'ivy-switch-buffer)

  (define-key evil-normal-state-map (kbd "C-h") 'evil-window-left)
  (define-key evil-normal-state-map (kbd "C-j") 'evil-window-down)
  (define-key evil-normal-state-map (kbd "C-k") 'evil-window-up)
  (define-key evil-normal-state-map (kbd "C-l") 'evil-window-right)
  (define-key evil-normal-state-map (kbd "M-j") 'evil-scroll-down)
  (define-key evil-normal-state-map (kbd "M-k") 'evil-scroll-up)

  (define-key evil-normal-state-map "u" 'undo-tree-undo)
  (define-key evil-normal-state-map (kbd "C-r") 'undo-tree-redo)

  (define-key evil-normal-state-map (kbd "M-t") 'neotree-toggle)
  (define-key evil-normal-state-map (kbd "<C-return>") 'shr-browse-url)
  (define-key key-translation-map (kbd "ESC") (kbd "C-g"))

  (define-key evil-normal-state-map (kbd "C-=") 'text-scale-increase)
  (define-key evil-normal-state-map (kbd "C--") 'text-scale-decrease)
  (define-key evil-normal-state-map (kbd "C-0") 'text-scale-adjust)

  (define-key evil-normal-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
  (define-key evil-normal-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
  (define-key evil-motion-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
  (define-key evil-motion-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)

  (defun my/c-c ()
    (interactive)
    (setq unread-command-events (listify-key-sequence (kbd "C-c"))))

  (defun my/c-k ()
    (interactive)
    (setq unread-command-events (listify-key-sequence (kbd "C-k"))))

  (evil-define-key 'normal global-map (kbd ",c") 'my/c-c)
  (evil-define-key 'normal global-map (kbd ",k") 'my/c-k)
#+END_SRC

*** Miscellaneous settings

**** Cursor shapes

Set the cursor shape for different evil states.
     
#+BEGIN_SRC emacs-lisp
  (set-default 'evil-normal-state-cursor 'hbar)
  (set-default 'evil-insert-state-cursor 'bar)
  (set-default 'evil-visual-state-cursor 'hbar)
  (set-default 'evil-motion-state-cursor 'box)
  (set-default 'evil-replace-state-cursor 'box)
  (set-default 'evil-operator-state-cursor 'hbar)
  (set-cursor-color "#80D1FF")
  (setq-default cursor-type 'bar) 
#+END_SRC

**** Small additions

We want /some/ Emacs in evil, so we change a few settings here.

#+BEGIN_SRC emacs-lisp
  (setq evil-cross-lines t
        evil-move-beyond-eol t
        evil-want-fine-undo t
        evil-symbol-word-search t
        evil-want-Y-yank-to-eol t
        evil-cross-lines t)
#+END_SRC

** Which-key

We install which-key in case we ever forget any keybinds.

#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :config (which-key-mode)
    (which-key-setup-side-window-bottom)
    (setq which-key-idle-delay 0.1))
#+END_SRC

** Ivy

Ivy helps with better completion and to replace the default M-x. Counsel adds a few things, ivy-rich makes it look better.

#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :config (ivy-mode t)
    (setq ivy-initial-inputs-alist nil)
    (setq ivy-count-format "[%d/%d] ")
    (setq ivy-use-virtual-buffers t)
    (setq ivy-height 33)
  (setq ivy-ignore-buffers '("\\` " "\\`\\*" "magit*")))

  (use-package counsel
    :after ivy
    :config (counsel-mode t))

  ;; (use-package ivy-posframe
  ;;   :after ivy
  ;;   :config
  ;;   (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-top-center)))
  ;;   (setq ivy-posframe-parameters
  ;;     '((left-fringe . 30)
  ;;       (right-fringe . 30)))
  ;;   (ivy-posframe-mode t))

  (use-package all-the-icons-ivy-rich
    :init (all-the-icons-ivy-rich-mode 1))

  (use-package ivy-rich
    :init (ivy-rich-mode 1))
#+END_SRC

** Dashboard

The default startup screen is bland, let's replace it with a nice dashboard. We also add some buttons, and make it more simplistic.

#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :config
    (setq dashboard-center-content t
      dashboard-show-shortcuts nil
      dashboard-banner-logo-title "Welcome to Emacs"
      dashboard-startup-banner "/home/matei/.config/emacs/pfp_rounded_small.png"
      dashboard-set-heading-icons t
      dashboard-set-file-icons t
      dashboard-set-navigator t)
    (setq dashboard-items '())
    (dashboard-setup-startup-hook))
  (setq dashboard-navigator-buttons
        `(((,
           (all-the-icons-octicon "file-text" :height 1.0 :v-adjust 0.05)
           "Open recent files"
           "Open recent files"
           (lambda (&rest _) (counsel-recentf)))

          (,(all-the-icons-octicon "bookmark" :height 1.0 :v-adjust 0.0)
           "Open bookmarks"
           "Open bookmarks"
           (lambda (&rest _) (counsel-bookmark)))

          (,(all-the-icons-octicon "rocket" :height 1.0 :v-adjust 0.05)
           "Open projects"
           "Open projects"
           (lambda (&rest _) (projectile-switch-project))))

          ((,(all-the-icons-octicon "calendar" :height 1.0 :v-adjust 0.05)
           "View org agenda"
           "View org agenda"
           (lambda (&rest _) (org-agenda)))

          (,(all-the-icons-octicon "keyboard" :height 1.0 :v-adjust 0.0)
           "Restore session"
           "Restore session"
           (lambda (&rest _) (persp-state-load "~/.config/emacs/perspective/default.el"))))))
  (setq dashboard-footer-messages '(
  "While any text editor can save your files, only Emacs can save your soul"
  "Welcome to the Church of Emacs"
  "Emacs - The thermonuclear word processor"
  "Escape Meta Alt Control Shift"
  "Eight Megs And Constantly Swapping"
  "Vi Vi Vi, the editor of the beast"))

  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+END_SRC

