config/emacs/emacs.org
** File tree

Neotree is a cool file tree, so we install it. Although I usually use dired, neotree can be useful if you need a tree layout.

#+BEGIN_SRC emacs-lisp
  (use-package neotree)
  (setq neo-theme (if (display-graphic-p) 'icons 'arrow))
  (add-hook 'neotree-mode-hook
           (lambda ()
             (define-key evil-normal-state-local-map (kbd "SPC") 'neotree-quick-look)
             (define-key evil-normal-state-local-map (kbd "RET") 'neotree-enter)
             (define-key evil-normal-state-local-map (kbd "g") 'neotree-refresh)
             (define-key evil-normal-state-local-map (kbd "n") 'neotree-next-line)
             (define-key evil-normal-state-local-map (kbd "p") 'neotree-previous-line)
             (define-key evil-normal-state-local-map (kbd "A") 'neotree-stretch-toggle)
             (define-key evil-normal-state-local-map (kbd "H") 'neotree-hidden-file-toggle)))
#+END_SRC

** Magit

Magit is the best git client, and it is a /must/. Less typing, less time spent using git, and more coding.

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :defer t)
#+END_SRC

** Parentheses

*** Smart parentheses
   
Most code editors automatically match parentheses, but Emacs doesn't do this, so we install a package.

#+BEGIN_SRC emacs-lisp
    (use-package smartparens
      :config (smartparens-global-mode)
      (show-smartparens-mode))
#+END_SRC

*** Rainbow parentheses

Most editors also automatically color matching parentheses, but again, we need to install a package for this.

#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :config
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+END_SRC

** Icons

We need all-the-icons for some packages, so let's install it.

#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons)
#+END_SRC

** Modeline

The default modeline is ugly, this package replaces it with one that looks like the doom modeline.

#+BEGIN_SRC emacs-lisp
  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :config (setq doom-modeline-height 25)
    (setq doom-modeline-icon t))
#+END_SRC

** Undo-tree

We want to visualize undo history better, so we install undo-tree.

#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
    :config
    (global-undo-tree-mode))
    (setq undo-tree-auto-save-history t)
    (setq undo-tree-history-directory-alist '(("." . "~/.config/emacs/undo")))
#+END_SRC

** Formatter

Let's install a formatter to format our horrible code.

#+BEGIN_SRC emacs-lisp
  (use-package format-all
    :hook (prog-mode . format-all-mode))
#+END_SRC

** Colorscheme

My colorscheme uses doom-themes as a base, so we have to install it.

#+BEGIN_SRC emacs-lisp
 (use-package doom-themes
   :config
   (load-theme 'doom-quiet-dark t)
   (doom-themes-neotree-config))
#+END_SRC

** Mail

Emacs can do everything, including manage mail.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-maildir (expand-file-name "~/Mail/"))

  (setq mu4e-drafts-folder "/Drafts")
  (setq mu4e-sent-folder   "/Sent")
  (setq mu4e-trash-folder  "/Deleted")

  (setq mu4e-get-mail-command "mbsync -a"
    mu4e-view-prefer-html t
    mu4e-update-interval 180
    mu4e-headers-auto-update t
    mu4e-compose-signature-auto-include nil
    mu4e-compose-format-flowed t)

  (setq
   user-mail-address "mcotocel@outlook.com"
   user-full-name  "Matei Cotocel")

  (setq mu4e-view-show-images t)

  (setq message-send-mail-function 'smtpmail-send-it)
  (setq smtpmail-smtp-server "smtp-mail.outlook.com")
  (setq smtpmail-smtp-service 587 )
  (setq smtpmail-auth-credentials (expand-file-name "~/.authinfo"))
#+END_SRC

** Chat

*** Irc
   
It also has an IRC client available, so let's install and configure it.

#+BEGIN_SRC emacs-lisp
  (use-package circe)
  (setq circe-network-options
        `(("Libera Chat"
           :nick "Specter"
           :channels (:after-auth "#unixporn" "#emacs")
           :nickserv-password ,libera-password)))
  (setq enable-circe-display-images t)
  (setq enable-circe-color-nicks t)
  (add-hook 'circe-chat-mode-hook 'my-circe-prompt)
  (defun my-circe-prompt ()
    (lui-set-prompt
     (concat (propertize (concat (buffer-name) ">")
                         'face 'circe-prompt-face)
             " ")))
#+END_SRC

*** Matrix

I also install a matrix client.

#+begin_src emacs-lisp
  (straight-use-package 'matrix-client)
  (setq matrix-client-show-images t)
#+end_src

*** Discord rice presence

#+begin_src emacs-lisp
  ;;(use-package elcord
  ;;  :config
  ;;  (elcord-mode))
#+end_src

** RSS

I read RSS feeds, so we're going to configure a reader.

#+BEGIN_SRC emacs-lisp
  (use-package elfeed)
  (setq elfeed-feeds
         '(("http://www.reddit.com/r/emacs.rss" tech emacs)
           ("http://www.reddit.com/r/terminal_porn.rss" tech)))
  (add-to-list 'evil-emacs-state-modes 'elfeed-search-mode)
  (add-to-list 'evil-emacs-state-modes 'elfeed-show-mode)

  (use-package elfeed-dashboard
    :config
    (setq elfeed-dashboard-file "~/Org/elfeed-dashboard.org")
    (advice-add 'elfeed-search-quit-window :after #'elfeed-dashboard-update-links))
  (evil-set-initial-state 'elfeed-dashboard-mode 'emacs)
  ;(setq browse-url-browser-function 'browse-url-generic
  ;    browse-url-generic-program "qutebrowser")
#+END_SRC

** EMMS

Why not listen to music in Emacs?

#+BEGIN_SRC emacs-lisp
  (use-package emms)
  (emms-all)
  (emms-default-players)
  (setq emms-source-file-default-directory "/Volumes/PiNAS/Media/Music/")
#+END_SRC

