config/emacs/emacs.tex

\subsection*{File tree}
\label{sec:org7570509}

Neotree is a cool file tree, so we install it. Although I usually use dired, neotree can be useful if you need a tree layout.

\begin{minted}[]{common-lisp}
(use-package neotree)
(setq neo-theme (if (display-graphic-p) 'icons 'arrow))
(add-hook 'neotree-mode-hook
         (lambda ()
           (define-key evil-normal-state-local-map (kbd "SPC") 'neotree-quick-look)
           (define-key evil-normal-state-local-map (kbd "RET") 'neotree-enter)
           (define-key evil-normal-state-local-map (kbd "g") 'neotree-refresh)
           (define-key evil-normal-state-local-map (kbd "n") 'neotree-next-line)
           (define-key evil-normal-state-local-map (kbd "p") 'neotree-previous-line)
           (define-key evil-normal-state-local-map (kbd "A") 'neotree-stretch-toggle)
           (define-key evil-normal-state-local-map (kbd "H") 'neotree-hidden-file-toggle)))
\end{minted}

\subsection*{Magit}
\label{sec:org6a1c149}

Magit is the best git client, and it is a \emph{must}. Less typing, less time spent using git, and more coding.

\begin{minted}[]{common-lisp}
(use-package magit
  :defer t)
\end{minted}

\subsection*{Parentheses}
\label{sec:org5e142a2}

\subsubsection*{Smart parentheses}
\label{sec:orgf65daf8}

Most code editors automatically match parentheses, but Emacs doesn't do this, so we install a package.

\begin{minted}[]{common-lisp}
(use-package smartparens
  :config (smartparens-global-mode)
  (show-smartparens-mode))
\end{minted}

\subsubsection*{Rainbow parentheses}
\label{sec:org3d2152c}

Most editors also automatically color matching parentheses, but again, we need to install a package for this.

\begin{minted}[]{common-lisp}
(use-package rainbow-delimiters
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
\end{minted}

\subsection*{Icons}
\label{sec:org25ed66b}

We need all-the-icons for some packages, so let's install it.

\begin{minted}[]{common-lisp}
(use-package all-the-icons)
\end{minted}

\subsection*{Modeline}
\label{sec:org2aaed79}

The default modeline is ugly, this package replaces it with one that looks like the doom modeline.

\begin{minted}[]{common-lisp}
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :config (setq doom-modeline-height 25)
  (setq doom-modeline-icon t))
\end{minted}

\subsection*{Undo-tree}
\label{sec:org544f218}

We want to visualize undo history better, so we install undo-tree.

\begin{minted}[]{common-lisp}
(use-package undo-tree
  :config
  (global-undo-tree-mode))
  (setq undo-tree-auto-save-history t)
  (setq undo-tree-history-directory-alist '(("." . "~/.config/emacs/undo")))
\end{minted}

\subsection*{Formatter}
\label{sec:org24e3f50}

Let's install a formatter to format our horrible code.

\begin{minted}[]{common-lisp}
(use-package format-all
  :hook (prog-mode . format-all-mode))
\end{minted}

\subsection*{Colorscheme}
\label{sec:orga0cd7f4}

My colorscheme uses doom-themes as a base, so we have to install it.

\begin{minted}[]{common-lisp}
(use-package doom-themes
  :config
  (load-theme 'doom-quiet-dark t)
  (doom-themes-neotree-config))
\end{minted}

\subsection*{Mail}
\label{sec:org0ed9a06}

Emacs can do everything, including manage mail.

\begin{minted}[]{common-lisp}
(setq mu4e-maildir (expand-file-name "~/Mail/"))

(setq mu4e-drafts-folder "/Drafts")
(setq mu4e-sent-folder   "/Sent")
(setq mu4e-trash-folder  "/Deleted")

(setq mu4e-get-mail-command "mbsync -a"
  mu4e-view-prefer-html t
  mu4e-update-interval 180
  mu4e-headers-auto-update t
  mu4e-compose-signature-auto-include nil
  mu4e-compose-format-flowed t)

(setq
 user-mail-address "mcotocel@outlook.com"
 user-full-name  "Matei Cotocel")

(setq mu4e-view-show-images t)

(setq message-send-mail-function 'smtpmail-send-it)
(setq smtpmail-smtp-server "smtp-mail.outlook.com")
(setq smtpmail-smtp-service 587 )
(setq smtpmail-auth-credentials (expand-file-name "~/.authinfo"))
\end{minted}

\subsection*{Chat}
\label{sec:org76c41b9}

\subsubsection*{Irc}
\label{sec:orgdd5c526}

It also has an IRC client available, so let's install and configure it.

\begin{minted}[]{common-lisp}
(use-package circe)
(setq circe-network-options
      `(("Libera Chat"
         :nick "Specter"
         ;; :channels (:after-auth "#unixporn" "#nixers")
         :nickserv-password ,libera-password)))
(setq enable-circe-display-images t)
(setq enable-circe-color-nicks t)
(add-hook 'circe-chat-mode-hook 'my-circe-prompt)
(defun my-circe-prompt ()
  (lui-set-prompt
   (concat (propertize (concat (buffer-name) ">")
                       'face 'circe-prompt-face)
           " ")))
\end{minted}

\subsubsection*{Matrix}
\label{sec:orge10393a}

I also install a matrix client.

\begin{minted}[]{common-lisp}
(straight-use-package 'matrix-client)
(setq matrix-client-show-images t)
\end{minted}

\subsection*{RSS}
\label{sec:orgfae8ae2}

I read RSS feeds, so we're going to configure a reader.

\begin{minted}[]{common-lisp}
(use-package elfeed)
(setq elfeed-feeds
       '(("http://www.reddit.com/r/emacs.rss" tech)
         ("https://www.reddit.com/r/linux.rss" tech)
         ("https://nixers.net/syndication.php?fid=12,15&limit=25" tech)
         ("https://www.reddit.com/r/DigitalGardens.rss" note-taking)
         ("https://www.reddit.com/r/PKMS.rss" note-taking)
         ("http://www.reddit.com/r/terminal_porn.rss" tech)))
(add-to-list 'evil-emacs-state-modes 'elfeed-search-mode)
(add-to-list 'evil-emacs-state-modes 'elfeed-show-mode)
\end{minted}

\subsection*{EMMS}
\label{sec:orgba4c2c1}

Why not listen to music in Emacs?

\begin{minted}[]{common-lisp}
(use-package emms)
(emms-all)
(emms-default-players)
(setq emms-source-file-default-directory "/Volumes/PiNAS/Media/Music/")
\end{minted}
