config/emacs/emacs.el

(use-package neotree)
(setq neo-theme (if (display-graphic-p) 'icons 'arrow))
(add-hook 'neotree-mode-hook
         (lambda ()
           (define-key evil-normal-state-local-map (kbd "SPC") 'neotree-quick-look)
           (define-key evil-normal-state-local-map (kbd "RET") 'neotree-enter)
           (define-key evil-normal-state-local-map (kbd "g") 'neotree-refresh)
           (define-key evil-normal-state-local-map (kbd "n") 'neotree-next-line)
           (define-key evil-normal-state-local-map (kbd "p") 'neotree-previous-line)
           (define-key evil-normal-state-local-map (kbd "A") 'neotree-stretch-toggle)
           (define-key evil-normal-state-local-map (kbd "H") 'neotree-hidden-file-toggle)))

(use-package magit
  :defer t)

(use-package smartparens
  :config (smartparens-global-mode)
  (show-smartparens-mode))

(use-package rainbow-delimiters
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :config (setq doom-modeline-height 25)
  (setq doom-modeline-icon t))

(use-package undo-tree
  :config
  (global-undo-tree-mode))
  (setq undo-tree-auto-save-history t)
  (setq undo-tree-history-directory-alist '(("." . "~/.config/emacs/undo")))

(use-package format-all
  :hook (prog-mode . format-all-mode))

(use-package doom-themes
  :config
  (load-theme 'doom-quiet-dark t)
  (doom-themes-neotree-config))

(setq mu4e-maildir (expand-file-name "~/Mail/"))

(setq mu4e-drafts-folder "/Drafts")
(setq mu4e-sent-folder   "/Sent")
(setq mu4e-trash-folder  "/Deleted")

(setq mu4e-get-mail-command "mbsync -a"
  mu4e-view-prefer-html t
  mu4e-update-interval 180
  mu4e-headers-auto-update t
  mu4e-compose-signature-auto-include nil
  mu4e-compose-format-flowed t)

(setq
 user-mail-address "mcotocel@outlook.com"
 user-full-name  "Matei Cotocel")

(setq mu4e-view-show-images t)

(setq message-send-mail-function 'smtpmail-send-it)
(setq smtpmail-smtp-server "smtp-mail.outlook.com")
(setq smtpmail-smtp-service 587 )
(setq smtpmail-auth-credentials (expand-file-name "~/.authinfo"))

(use-package circe)
(setq circe-network-options
      `(("Libera Chat"
         :nick "Specter"
         :channels (:after-auth "#unixporn" "#emacs")
         :nickserv-password ,libera-password)))
(setq enable-circe-display-images t)
(setq enable-circe-color-nicks t)
(add-hook 'circe-chat-mode-hook 'my-circe-prompt)
(defun my-circe-prompt ()
  (lui-set-prompt
   (concat (propertize (concat (buffer-name) ">")
                       'face 'circe-prompt-face)
           " ")))

(straight-use-package 'matrix-client)
(setq matrix-client-show-images t)

;;(use-package elcord
;;  :config
;;  (elcord-mode))

(use-package elfeed)
(setq elfeed-feeds
       '(("http://www.reddit.com/r/emacs.rss" tech emacs)
         ("http://www.reddit.com/r/terminal_porn.rss" tech)))
(add-to-list 'evil-emacs-state-modes 'elfeed-search-mode)
(add-to-list 'evil-emacs-state-modes 'elfeed-show-mode)

(use-package elfeed-dashboard
  :config
  (setq elfeed-dashboard-file "~/Org/elfeed-dashboard.org")
  (advice-add 'elfeed-search-quit-window :after #'elfeed-dashboard-update-links))
(evil-set-initial-state 'elfeed-dashboard-mode 'emacs)
;(setq browse-url-browser-function 'browse-url-generic
;    browse-url-generic-program "qutebrowser")

(use-package emms)
(emms-all)
(emms-default-players)
(setq emms-source-file-default-directory "/Volumes/PiNAS/Media/Music/")
