config/emacs/emacs.org
** LSP

I use Emacs for coding as well, so we're going to configure lsp-mode.

#+BEGIN_SRC emacs-lisp
  (use-package lsp-mode
    :init
    :hook ((python-mode . lsp)
           (lua-mode . lsp)
           (sh-mode . lsp)
           (lisp-mode . lsp)
           (emacs-lisp-mode . lsp)
           (css-mode . lsp)
           (html-mode . lsp)
           (json-mode . lsp)
           (markdown-mode . lsp)
           (latex-mode . lsp)
           (go-mode . lsp)
           (lsp-mode . lsp-enable-which-key-integration))
    :commands lsp
    :config
    (setq lsp-enable-symbol-highlighting nil)
    lsp-ui-doc-enable t
    lsp-lens-enable nil
    lsp-headerline-breadcrumb-enable nil
    lsp-ui-sideline-enable nil
    lsp-ui-sideline-enable t
    lsp-modeline-code-actions-enable t
    lsp-ui-sideline-enable t
    lsp-ui-doc-border nil
    lsp-eldoc-enable-hover t)
  (setq lsp-log-io nil)
  (setq lsp-enable-file-watchers nil)

  (use-package lsp-ui :commands lsp-ui-mode)

  (setq lsp-enable-symbol-highlighting nil)
  (custom-set-faces '(nobreak-space ((t nil))))

  (use-package company
    :hook (prog-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . company-select-next)))

  (setq company-idle-delay 0.1
        company-minimum-prefix-length 1
        company-selection-wrap-around t
        company-require-match 'never
        company-dabbrev-downcase nil
        company-dabbrev-ignore-case t
        company-dabbrev-other-buffers nil
        company-tooltip-limit 5
        company-tooltip-minimum-width 50)

  (use-package company-box
    :hook (company-mode . company-box-mode)
    :config
    (setq company-box-scrollbar nil))

  (use-package go-mode)
  (use-package json-mode)
  (use-package lua-mode)
  (use-package nix-mode)
  (use-package lsp-jedi
    :hook (python-mode . lsp-jedi))

  (use-package yasnippet
    :hook (prog-mode . yas-global-mode))

  (use-package yasnippet-snippets
    :defer t)
#+END_SRC

** Flycheck

Syntax checking for code.

#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :ensure t
  :init (global-flycheck-mode))
#+END_SRC

** Projectile

Here, we install and configure projectile, which is a project interaction library.

#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :config (projectile-mode 1))
#+END_SRC

** Indentation guides

Guides to see level of indentation

#+begin_src emacs-lisp 
  (use-package highlight-indent-guides
    :config (setq highlight-indent-guides-method 'character)
    :hook (prog-mode-hook . highlight-indent-guides-mode))
#+end_src

* Org mode

** Files locations
  
We want to save everything in /one/ location.

#+BEGIN_SRC emacs-lisp
  (setq org-directory "~/Org/"
        org-default-notes-file "~/Org/notes.org")
  (setq org-agenda-files '("~/Org/"))
#+END_SRC

** Exporting

Let's set the export backends to things I commonly use, along with some extra settings for html exports.

#+BEGIN_SRC emacs-lisp
  (setq org-export-backends '(latex md html))

  (require 'org)
  (require 'ox-latex)
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted) 

  (use-package htmlize)

  (setq org-latex-pdf-process
        '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

  (setq org-src-fontify-natively t)

  (setq org-export-with-section-numbers nil)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((R . t)
     (latex . t)))
  (setq org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"./style.css\"/>"
    org-html-doctype "html5")
#+END_SRC

** Bullets

Package that makes the bullets look nicer

#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :after org
    :hook
    (org-mode . (lambda () (org-bullets-mode 1))))
#+END_SRC

** UI

A few additions to make everything look neater

#+BEGIN_SRC emacs-lisp
  (setq org-hide-emphasis-markers t)
  (setq org-image-actual-width '(300))
  (set-face-attribute 'org-headline-done nil :strike-through t)
  (setq org-agenda-start-on-weekday 0)
  (setq org-src-tab-acts-natively t)
#+END_SRC

** Keywords

Let's add our own custom keywords and highlight them

#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
       '((sequence "TODO" "WAITING" "PAUSED" "ALMOST" "OPTIONAL" "IMPORTANT" "DONE")))
  (setq org-todo-keyword-faces
    '(("TODO"      . (:foreground "#FF8080" :weight bold))
      ("WAITING"   . (:foreground "#FFFE80" :weight bold))
      ("PAUSED"    . (:foreground "#D5D5D5" :weight bold))
      ("ALMOST"    . (:foreground "#80D1FF" :weight bold))
      ("OPTIONAL"  . (:foreground "#C780FF" :weight bold))
      ("IMPORTANT" . (:foreground "#80FFE4" :weight bold))
      ("DONE"      . (:foreground "#97D59B" :weight bold))))
#+END_SRC

** Org roam

Org roam makes Org even better

#+BEGIN_SRC emacs-lisp
  (use-package org-roam
    :custom
    (org-roam-directory "~/org/")
    :config
    (org-roam-setup)
    (require 'org-roam-protocol))

  (setq org-roam-v2-ack t)

  (use-package org-roam-ui
    :straight
    (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
    :after org-roam
    :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+END_SRC

** Org capture

We also add some templates for Org capture

#+BEGIN_SRC emacs-lisp
  (setq org-capture-templates
      '(("t" "Todo" entry (file "~/Org/Refile.org")
         "* TODO %?\n%U" :empty-lines 1)
        ("n" "Note" entry (file "~/Org/Refile.org")
         "* NOTE %?\n%U" :empty-lines 1)))
#+END_SRC

** Babel

