config/emacs/emacs.tex

\subsection*{Babel}
\label{sec:org9b11c41}

\subsubsection*{Go support}
\label{sec:org1077c5e}

Go support for babel

\begin{minted}[]{common-lisp}
(use-package ob-go
  :config (org-babel-do-load-languages
 'org-babel-load-languages
 '((go . t))))
\end{minted}

\subsection*{Faces}
\label{sec:org0ec189f}

This changes the faces of Org mode to a nice sans serif font.

\begin{minted}[]{common-lisp}
(let* ((base-font-color     (face-foreground 'default nil 'default))
       (headline           `(:inherit default :weight bold :foreground "grey" :height 1.6)))

  (custom-theme-set-faces
   'user
   `(org-level-8 ((t (,@headline))))
   `(org-level-7 ((t (,@headline))))
   `(org-level-6 ((t (,@headline))))
   `(org-level-5 ((t (,@headline))))
   `(org-level-4 ((t (,@headline :height 1.2))))
   `(org-level-3 ((t (,@headline :height 1.3))))
   `(org-level-2 ((t (,@headline :height 1.4))))
   `(org-level-1 ((t (,@headline :height 1.5))))
   `(org-document-title ((t (,@headline :height 1.6 :underline nil))))))

(custom-theme-set-faces
 'user
 '(fixed-pitch ((t ( :family "Iosevka Nerd Font" :height 160)))))

(custom-theme-set-faces
 'user
 '(org-block                 ((t (:inherit fixed-pitch))))
 '(org-code                  ((t (:inherit fixed-pitch :weight normal))))
 '(org-document-info         ((t (,@headline :height 1.6))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-indent                ((t (:inherit (org-hide fixed-pitch)))))
 '(org-link                  ((t (:foreground "royal blue" :underline t))))
 '(org-meta-line             ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-property-value        ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword       ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-table                 ((t (:inherit fixed-pitch :foreground "#384149"))))
 '(org-tag                   ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
 '(org-verbatim              ((t (:inherit (shadow fixed-pitch))))))
\end{minted}

\subsection*{Present}
\label{sec:org9fda470}

Make presentations with org mode.

\begin{minted}[]{common-lisp}
(use-package org-present)
\end{minted}

\section*{Functions}
\label{sec:org58bea50}

Edit the current file as root.

\begin{minted}[]{common-lisp}
(defun edit-file-root ()
  "Use tramp to edit the current buffer as root"
  (interactive)
  (when buffer-file-name
    (find-alternate-file
     (concat "/sudo:root@localhost:"
             buffer-file-name))))
\end{minted}
\end{document}
